content/308.6_CE615_Spring2026.org
#+TITLE: CE 615: Structural Design for Fire - Spring 2026
# #+OPTIONS: 
#+OPTIONS: toc:1
#+MACRO: mtime (eval (format-time-string "%d-%B-%Y" (nth 5 (file-attributes buffer-file-name))))



* Basic Information
|----------------+---------------------------------------------|
| Class timings  | Wednesday, Friday, 15:30-16:50 hrs          |
| Class location | AB 7/107                                    |
|----------------+---------------------------------------------|
| Instructor     | S Chandrasekaran (srinivasan.c@iitgn.ac.in) |
|----------------+---------------------------------------------|
| Instructor     | Gaurav Srivastava (gauravs@iitgn.ac.in)     |
|----------------+---------------------------------------------|
| Co-Instructor  | Dravesh Yadav (dravesh.yadav@iitgn.ac.in)   |
|----------------+---------------------------------------------|
- Assignments can be [[https://drive.google.com/drive/folders/1db0YBHTID7TIAGE91E49uuHP_Ej6htHg?usp=drive_link][downloaded from here]].


* Course objectives, syllabus, books, pre-requisites
** Objectives
- To learn about the effects of fire on reinforced concrete and steel structures.
- To learn about the behavior and characterization of fires of different kinds.
- To be able to design reinforced concrete and steel structures under fire conditions.
	
** Syllabus
- Fire characteristics (combustion, ignition, flammability limits, etc.)
- Properties of steel and concrete at high temperatures.
- Heat transfer mechanisms: conduction, convection and radiation. Mathematical modeling of the heat transfer problem.
- Fire as a hazard; development of a fire in the open and in a compartment.
- Stages of a compartment fire: pre-flashover, flashover and post-flashover.
- Characterization of a fire through time-temperature and time-HRR; t^2 fire model.
- Estimation of fire curves through fire load energy density and compartment characteristics. Ventilation factor; fuel vs. ventilation controlled fire.
- Design and parametric fire curves.
- Heat transfer within concrete structures (semi-infinite idealization) and steel structures (lumped capacity idealization).
- Empirical and code-based methods to compute temperature within structural systems.
- Design of steel structures under fire.
- Design of reinforced concrete structures under fire; 500 isotherm method, zone method.
- Equivalent fire severity.
		
** Textbook
- Fire-resistant Design of Structures by S. Chandrasekaran and G. Srivastava, CRC Press.
# comment
	
** Reference Books
- Fundamentals of Heat and Mass Transfer by T.L. Bergman, A.S. Lavine, F.P. Incropera and D.P. Dewitt, John Wiley & Sons.
- An Introduction to Fire Dynamics by D. Drysdale, Wiley.
- Temperature calculation in Fire Safety Engineering by U. Wickstrom, Springer.
  
** Codes and Standards
- National Building Code (NBC) 2016 of India.
- IS 800 (steel) and IS 456 (reinforced concrete)
- Eurocode EN 1990:2002 (basis of structural design)
- Eurocode EN 1991-1-1 and EN 1991-1-2 (actions)
- Eurocode EN 1992-1-1 and EN 1992-1-2 (reinforced concrete)
- Eurocode EN 1993-1-1 and EN 1993-1-2 (steel)
- Eurocode EN 1996-1-1 and EN 1996-1-2 (masonry)

* Course Policies
** Etiquette
- Please be considerate about everyone's time.
- In all emails pertaining to this course, please have "CE615" in the subject line.
	- (note that there is no space or hyphen or anything between CE and 615)

** Cheating
Cheating cases (assignments/codes/exams/project) will be dealt with in accordance with the Institute norms. It is expected that everyone will uphold the honor code.

** Grading
Following will be the weightage of different components of assessment
| Component            | Weightage |
|----------------------+-----------|
| Homework assignments |       30% |
| Group projects       |       20% |
| Exams (two)          |  25% each |

** Modes of formal assessment
- Assignments will entail analysis/practical problems, coding, reports, etc. and may be individual or group.
- Group projects will involve more aggregating tasks including coding, use of a software, or design of larger systems.
- Exams may be in-class or take-home.
	
** Emphasis on self-learning
It is important to develop the habit of self-learning. A number of reading assignments and self-exercises will be given during the course. These will not be formally graded and it will be expected that students will go through them on a regular basis on their own.

* Calendar (tentative)
- Will be updated regularly
- See [[./308.5_CE615_Spring2025.org][previous year's website for details of the covered topics]].
** [L1] Jan 07, Wed
- Introduction to the course and effects of fire on structures.
** [L2] Jan 09, Fri
- Modes of heat transfer. Fourier's law, Newton's law of cooling, and Stefan's law of radiation
- Boundary conditions in fire engineering
- Electrical circuit analogy for heat transfer
- Derivation of the transient heat equation.
** Jan 14, Wed - no class
- Makar Sankranti
** [L3] Jan 16, Fri
- Lumped heat capacity approach for idealizing heat transfer in conductive materials
- Introduction to natural fire curve and standard fire curve
** [L4] Jan 21, Wed
- Semi-infinite idealization for idealizing heat transfer in insulating materials
- Fire load calculation
- HRR-time models for fire (t^2 model)
** [L5] Jan 23, Fri
- Behavior of compartment fires and flashover
- Fuel-controlled and ventilation-controlled fire
- Thomas correlation for critical heat flux for flashover of single compartments
** [L6] Jan 28, Wed
- Parametric time-temperature fire curves - EN approach
** [L7] Jan 30, Fri
- Thermal and mechanical properties of steel and concrete at elevated temperatures
- Equivalent fire severity
- Visit to the fire lab
- *Assignment 1* given - [[https://drive.google.com/drive/folders/1db0YBHTID7TIAGE91E49uuHP_Ej6htHg?usp=drive_link][download from here]] (due on 11 Feb)
** [L8] Feb 04, Wed
- Overview of heat-transfer calculations
- Use of Eurocodes for determining material properties (thermal and mechanical) and temperature calculations
** [L9] Feb 06, Fri
** [L10] Feb 11, Wed
** [L11] Feb 13, Fri
** [L12] Feb 18, Wed
** Feb 20 - 27: Mid semester exam week
** Feb 28 - Mar 8: Mid semester recess
** [L13] Mar 11, Wed
** [L14] Mar 13, Fri
** [L15] Mar 18, Wed
** [L16] Mar 20, Fri
** [L17] Mar 25, Wed
** [L18] Mar 27, Fri
** [L19] Apr 01, Wed
** Apr 03, Fri - no class
- Good Friday
** [L20] Apr 08, Wed
** [L21] Apr 10, Fri
** [L22] Apr 15, Wed
** [L23] Apr 17, Fri
** [L24] Apr 23, Thu
** Apr 24 - May 01: End semester exam week

#+HTML: <small>
(Last updated: {{{mtime}}})
#+HTML: </small>
