308.6_CE615_Spring2026.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-09 Thu 12:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CE 615: Structural Design for Fire - Spring 2026</title>
<meta name="generator" content="Org Mode" />

<link rel='stylesheet' href='gs_simple.css' />
</head>
<body>
<div id="preamble" class="status">

<center>
<nav>
<a href="/index.html">Home</a>
<a href="/research.html">Research</a>
<a href="/teaching.html">Teaching</a>
<a href="/students.html">Students</a>
</nav>
</center>
</div>
<div id="content" class="content">
<h1 class="title">CE 615: Structural Design for Fire - Spring 2026</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfc12d23">Basic Information</a></li>
<li><a href="#orge40efb5">Course objectives, syllabus, books, pre-requisites</a></li>
<li><a href="#orgde83f4d">Course Policies</a></li>
<li><a href="#org7baa4df">Calendar (tentative)</a></li>
</ul>
</div>
</div>



<div id="outline-container-orgfc12d23" class="outline-2">
<h2 id="orgfc12d23">Basic Information</h2>
<div class="outline-text-2" id="text-orgfc12d23">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Class timings</th>
<th scope="col" class="org-left">Wednesday, Friday, 15:30-16:50 hrs</th>
</tr>

<tr>
<th scope="col" class="org-left">Class location</th>
<th scope="col" class="org-left">AB 7/107</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Instructor</td>
<td class="org-left">S Chandrasekaran (srinivasan.c@iitgn.ac.in)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Instructor</td>
<td class="org-left">Gaurav Srivastava (gauravs@iitgn.ac.in)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Co-Instructor</td>
<td class="org-left">Dravesh Yadav (dravesh.yadav@iitgn.ac.in)</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>Assignments can be <a href="https://drive.google.com/drive/folders/1db0YBHTID7TIAGE91E49uuHP_Ej6htHg?usp=drive_link">downloaded from here</a>.</li>
</ul>
</div>
</div>


<div id="outline-container-orge40efb5" class="outline-2">
<h2 id="orge40efb5">Course objectives, syllabus, books, pre-requisites</h2>
<div class="outline-text-2" id="text-orge40efb5">
</div>
<div id="outline-container-orgab2aa94" class="outline-3">
<h3 id="orgab2aa94">Objectives</h3>
<div class="outline-text-3" id="text-orgab2aa94">
<ul class="org-ul">
<li>To learn about the effects of fire on reinforced concrete and steel structures.</li>
<li>To learn about the behavior and characterization of fires of different kinds.</li>
<li>To be able to design reinforced concrete and steel structures under fire conditions.</li>
</ul>
</div>
</div>

<div id="outline-container-orga3c6196" class="outline-3">
<h3 id="orga3c6196">Syllabus</h3>
<div class="outline-text-3" id="text-orga3c6196">
<ul class="org-ul">
<li>Fire characteristics (combustion, ignition, flammability limits, etc.)</li>
<li>Properties of steel and concrete at high temperatures.</li>
<li>Heat transfer mechanisms: conduction, convection and radiation. Mathematical modeling of the heat transfer problem.</li>
<li>Fire as a hazard; development of a fire in the open and in a compartment.</li>
<li>Stages of a compartment fire: pre-flashover, flashover and post-flashover.</li>
<li>Characterization of a fire through time-temperature and time-HRR; t<sup>2</sup> fire model.</li>
<li>Estimation of fire curves through fire load energy density and compartment characteristics. Ventilation factor; fuel vs. ventilation controlled fire.</li>
<li>Design and parametric fire curves.</li>
<li>Heat transfer within concrete structures (semi-infinite idealization) and steel structures (lumped capacity idealization).</li>
<li>Empirical and code-based methods to compute temperature within structural systems.</li>
<li>Design of steel structures under fire.</li>
<li>Design of reinforced concrete structures under fire; 500 isotherm method, zone method.</li>
<li>Equivalent fire severity.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc847adf" class="outline-3">
<h3 id="orgc847adf">Textbook</h3>
<div class="outline-text-3" id="text-orgc847adf">
<ul class="org-ul">
<li>Fire-resistant Design of Structures by S. Chandrasekaran and G. Srivastava, CRC Press.</li>
</ul>
</div>
</div>

<div id="outline-container-org62773bd" class="outline-3">
<h3 id="org62773bd">Reference Books</h3>
<div class="outline-text-3" id="text-org62773bd">
<ul class="org-ul">
<li>Fundamentals of Heat and Mass Transfer by T.L. Bergman, A.S. Lavine, F.P. Incropera and D.P. Dewitt, John Wiley &amp; Sons.</li>
<li>An Introduction to Fire Dynamics by D. Drysdale, Wiley.</li>
<li>Temperature calculation in Fire Safety Engineering by U. Wickstrom, Springer.</li>
</ul>
</div>
</div>

<div id="outline-container-org29c6819" class="outline-3">
<h3 id="org29c6819">Codes and Standards</h3>
<div class="outline-text-3" id="text-org29c6819">
<ul class="org-ul">
<li>National Building Code (NBC) 2016 of India.</li>
<li>IS 800 (steel) and IS 456 (reinforced concrete)</li>
<li>Eurocode EN 1990:2002 (basis of structural design)</li>
<li>Eurocode EN 1991-1-1 and EN 1991-1-2 (actions)</li>
<li>Eurocode EN 1992-1-1 and EN 1992-1-2 (reinforced concrete)</li>
<li>Eurocode EN 1993-1-1 and EN 1993-1-2 (steel)</li>
<li>Eurocode EN 1996-1-1 and EN 1996-1-2 (masonry)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgde83f4d" class="outline-2">
<h2 id="orgde83f4d">Course Policies</h2>
<div class="outline-text-2" id="text-orgde83f4d">
</div>
<div id="outline-container-orgefdd5df" class="outline-3">
<h3 id="orgefdd5df">Etiquette</h3>
<div class="outline-text-3" id="text-orgefdd5df">
<ul class="org-ul">
<li>Please be considerate about everyone's time.</li>
<li>In all emails pertaining to this course, please have "CE615" in the subject line.
<ul class="org-ul">
<li>(note that there is no space or hyphen or anything between CE and 615)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4b3a52c" class="outline-3">
<h3 id="org4b3a52c">Cheating</h3>
<div class="outline-text-3" id="text-org4b3a52c">
<p>
Cheating cases (assignments/codes/exams/project) will be dealt with in accordance with the Institute norms. It is expected that everyone will uphold the honor code.
</p>
</div>
</div>

<div id="outline-container-orgce1289e" class="outline-3">
<h3 id="orgce1289e">Grading</h3>
<div class="outline-text-3" id="text-orgce1289e">
<p>
Following will be the weightage of different components of assessment
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Component</th>
<th scope="col" class="org-right">Weightage</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Homework assignments</td>
<td class="org-right">30%</td>
</tr>

<tr>
<td class="org-left">Group projects</td>
<td class="org-right">20%</td>
</tr>

<tr>
<td class="org-left">Exams (two)</td>
<td class="org-right">25% each</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd126c50" class="outline-3">
<h3 id="orgd126c50">Modes of formal assessment</h3>
<div class="outline-text-3" id="text-orgd126c50">
<ul class="org-ul">
<li>Assignments will entail analysis/practical problems, coding, reports, etc. and may be individual or group.</li>
<li>Group projects will involve more aggregating tasks including coding, use of a software, or design of larger systems.</li>
<li>Exams may be in-class or take-home.</li>
</ul>
</div>
</div>

<div id="outline-container-orga661065" class="outline-3">
<h3 id="orga661065">Emphasis on self-learning</h3>
<div class="outline-text-3" id="text-orga661065">
<p>
It is important to develop the habit of self-learning. A number of reading assignments and self-exercises will be given during the course. These will not be formally graded and it will be expected that students will go through them on a regular basis on their own.
</p>
</div>
</div>
</div>

<div id="outline-container-org7baa4df" class="outline-2">
<h2 id="org7baa4df">Calendar (tentative)</h2>
<div class="outline-text-2" id="text-org7baa4df">
<ul class="org-ul">
<li>Will be updated regularly</li>
<li>See <a href="./308.5_CE615_Spring2025.html">previous year's website for details of the covered topics</a>.</li>
</ul>
</div>
<div id="outline-container-org231eae9" class="outline-3">
<h3 id="org231eae9">[L1] Jan 07, Wed</h3>
<div class="outline-text-3" id="text-org231eae9">
<ul class="org-ul">
<li>Introduction to the course and effects of fire on structures.</li>
</ul>
</div>
</div>
<div id="outline-container-orge551dc3" class="outline-3">
<h3 id="orge551dc3">[L2] Jan 09, Fri</h3>
<div class="outline-text-3" id="text-orge551dc3">
<ul class="org-ul">
<li>Modes of heat transfer. Fourier's law, Newton's law of cooling, and Stefan's law of radiation</li>
<li>Boundary conditions in fire engineering</li>
<li>Electrical circuit analogy for heat transfer</li>
<li>Derivation of the transient heat equation.</li>
</ul>
</div>
</div>
<div id="outline-container-org745bcc0" class="outline-3">
<h3 id="org745bcc0">Jan 14, Wed - no class</h3>
<div class="outline-text-3" id="text-org745bcc0">
<ul class="org-ul">
<li>Makar Sankranti</li>
</ul>
</div>
</div>
<div id="outline-container-orge55f5ba" class="outline-3">
<h3 id="orge55f5ba">[L3] Jan 16, Fri</h3>
<div class="outline-text-3" id="text-orge55f5ba">
<ul class="org-ul">
<li>Lumped heat capacity approach for idealizing heat transfer in conductive materials</li>
<li>Introduction to natural fire curve and standard fire curve</li>
</ul>
</div>
</div>
<div id="outline-container-org289669e" class="outline-3">
<h3 id="org289669e">[L4] Jan 21, Wed</h3>
<div class="outline-text-3" id="text-org289669e">
<ul class="org-ul">
<li>Semi-infinite idealization for idealizing heat transfer in insulating materials</li>
<li>Fire load calculation</li>
<li>HRR-time models for fire (t<sup>2</sup> model)</li>
</ul>
</div>
</div>
<div id="outline-container-org3359189" class="outline-3">
<h3 id="org3359189">[L5] Jan 23, Fri</h3>
<div class="outline-text-3" id="text-org3359189">
<ul class="org-ul">
<li>Behavior of compartment fires and flashover</li>
<li>Fuel-controlled and ventilation-controlled fire</li>
<li>Thomas correlation for critical heat flux for flashover of single compartments</li>
</ul>
</div>
</div>
<div id="outline-container-orge121114" class="outline-3">
<h3 id="orge121114">[L6] Jan 28, Wed</h3>
<div class="outline-text-3" id="text-orge121114">
<ul class="org-ul">
<li>Parametric time-temperature fire curves - EN approach</li>
</ul>
</div>
</div>
<div id="outline-container-orged77b85" class="outline-3">
<h3 id="orged77b85">[L7] Jan 30, Fri</h3>
<div class="outline-text-3" id="text-orged77b85">
<ul class="org-ul">
<li>Thermal and mechanical properties of steel and concrete at elevated temperatures</li>
<li>Equivalent fire severity</li>
<li>Visit to the fire lab</li>
<li><b>Assignment 1</b> given - <a href="https://drive.google.com/drive/folders/1db0YBHTID7TIAGE91E49uuHP_Ej6htHg?usp=drive_link">download from here</a> (due on 11 Feb)</li>
</ul>
</div>
</div>
<div id="outline-container-org154b130" class="outline-3">
<h3 id="org154b130">[L8] Feb 04, Wed</h3>
<div class="outline-text-3" id="text-org154b130">
<ul class="org-ul">
<li>Overview of heat-transfer calculations</li>
<li>Use of Eurocodes for determining material properties (thermal and mechanical) and temperature calculations</li>
</ul>
</div>
</div>
<div id="outline-container-org6a169a0" class="outline-3">
<h3 id="org6a169a0">[L9] Feb 06, Fri</h3>
</div>
<div id="outline-container-org7d3a537" class="outline-3">
<h3 id="org7d3a537">[L10] Feb 11, Wed</h3>
</div>
<div id="outline-container-org9c1e12d" class="outline-3">
<h3 id="org9c1e12d">[L11] Feb 13, Fri</h3>
</div>
<div id="outline-container-org7979c96" class="outline-3">
<h3 id="org7979c96">[L12] Feb 18, Wed</h3>
</div>
<div id="outline-container-org35398b5" class="outline-3">
<h3 id="org35398b5">Feb 20 - 27: Mid semester exam week</h3>
</div>
<div id="outline-container-org69facd8" class="outline-3">
<h3 id="org69facd8">Feb 28 - Mar 8: Mid semester recess</h3>
</div>
<div id="outline-container-org2c87b33" class="outline-3">
<h3 id="org2c87b33">[L13] Mar 11, Wed</h3>
</div>
<div id="outline-container-org443bd03" class="outline-3">
<h3 id="org443bd03">[L14] Mar 13, Fri</h3>
</div>
<div id="outline-container-orgd3da42b" class="outline-3">
<h3 id="orgd3da42b">[L15] Mar 18, Wed</h3>
</div>
<div id="outline-container-org71071cd" class="outline-3">
<h3 id="org71071cd">[L16] Mar 20, Fri</h3>
</div>
<div id="outline-container-org4629013" class="outline-3">
<h3 id="org4629013">[L17] Mar 25, Wed</h3>
</div>
<div id="outline-container-orgf35b53e" class="outline-3">
<h3 id="orgf35b53e">[L18] Mar 27, Fri</h3>
</div>
<div id="outline-container-org8e5030a" class="outline-3">
<h3 id="org8e5030a">[L19] Apr 01, Wed</h3>
</div>
<div id="outline-container-orgc29cf18" class="outline-3">
<h3 id="orgc29cf18">Apr 03, Fri - no class</h3>
<div class="outline-text-3" id="text-orgc29cf18">
<ul class="org-ul">
<li>Good Friday</li>
</ul>
</div>
</div>
<div id="outline-container-org98f4832" class="outline-3">
<h3 id="org98f4832">[L20] Apr 08, Wed</h3>
</div>
<div id="outline-container-org9ca2b5f" class="outline-3">
<h3 id="org9ca2b5f">[L21] Apr 10, Fri</h3>
</div>
<div id="outline-container-orgaec8864" class="outline-3">
<h3 id="orgaec8864">[L22] Apr 15, Wed</h3>
</div>
<div id="outline-container-org13f266b" class="outline-3">
<h3 id="org13f266b">[L23] Apr 17, Fri</h3>
</div>
<div id="outline-container-org0f53b7d" class="outline-3">
<h3 id="org0f53b7d">[L24] Apr 23, Thu</h3>
</div>
<div id="outline-container-org0c94e70" class="outline-3">
<h3 id="org0c94e70">Apr 24 - May 01: End semester exam week</h3>
<div class="outline-text-3" id="text-org0c94e70">
<small>
<p>
(Last updated: 09-April-2026)
</p>
</small>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

<footer>
Contact:
<a href='mailto:gauravs@iitgn.ac.in'>gauravs@iitgn.ac.in</a> (Work) |
<a href='mailto:it.gaurav@gmail.com'>it.gaurav@gmail.com</a> (Personal)
<br>
Created completely through <a href='https://www.gnu.org/software/emacs/'>Gnu Emacs</a> and <a href='https://orgmode.org'>Org Mode</a> (<a href='https://github.com/gaurav-iitgn/gaurav-iitgn.github.io'>source code</a>)
</footer>
</div>
</body>
</html>
